//=================================
//	迷路探索サンプル
//		毎回、上→右→下→左の順に通れるかチェックする
//		このプログラムは、ある条件を満たす迷路では、
//		先に進まなくなる。
//=================================
#include	"maze.h"

//=================================
//	プレーヤ情報
//=================================
static	Funcs	funcs = { "全方向" , init, walkAround };

//=================================
//	公開関数
//=================================
Funcs*	getDemo01Info	( void ) { return &funcs; }

//=================================
//	内部関数
//=================================
//---------------------------------------------------------
//	init ...	初期化を行う
//---------------------------------------------------------
static	void	init	( void )
{
	// no code
}

//---------------------------------------------------------
//	walkAround ...	次に進む方向(int)を決める
//				返り値	:	DirUp	上
//							DirDown	下
//							DirLeft	左
//							DirRight	右
//---------------------------------------------------------
static	int	walkAround	( void )
{
	int	dir;
	for ( dir = 0; dir < DirInvalid; dir++ ){
		MapStatus	stat = canMove ( dir );
		if ( stat != MapWall ){
			break;
		}
	}
	return dir;
}
